import React, { Component } from 'react';
import { TechsAccordion } from '../elements/TechsAccordion';


export class UsingTechs extends Component {
    static displayName = UsingTechs.name;

    render() {
        return (
            <div className="clearfix">
                <h1>Добро пожаловать в отель будущего</h1>
                <div className="d-inline-flex float-end justify-content-end" id ="ForTechsImage" style={{border: "{0,0,12,0} solid #ffffff", width: "35%"}}>
                    <img className="d-block rounded-3" src="images/ingeneer.jpg" style={{width: "100%"}}/>
                </div>
                <h4 className="lh-base pr-2">
                    Как компания, работающая в условиях конкуренции, мы понимаем: чтобы стать лучше, надо использовать лучшие технологии, 
                    провлекать молодых и амбициознных специалистов и прислушиваться к посетителям.
                </h4>
                <br/>
                <h4 className="lh-base">
                    Сегодня реалии таковы, что инновационные и полезные вещи появляются чуть ли не каждый день. Однако мы не берем в арсенал
                    все из них. Такие новшества проходят прежде всего наш отбор и только после его успешного прохождения мы начинаем ее использвоать. 
                </h4>
                <br/>
                <h4>
                    <b>А теперь более подробно.</b> Отбор состоит из следующих этапов:
                </h4>
                <ol><h5 className='lh-lg'>
                    <li>
                        <strong>Поиск</strong>. На данном этапе мы ищем инновации.
                    </li>
                    <li>
                        <strong>Консультация</strong>. Затем мы совещаемся с нащими специалистами, чтобы получить у них предварительную оценку.
                    </li>
                    <li>
                        <strong>Обращение к автору/владельцу технологии</strong>. На этом шаге происходит налаживание контактов. Если все прошло успешно - переходим на следующий.
                    </li>
                    <li>
                        <strong>Тестирование</strong>. Проверка работоспособности.
                    </li>
                    <li>
                        <strong>Испытательный срок</strong>. Во время данного этапа технология вводится в одном или двух отелях сети и оценивается его полезность.
                    </li>
                    <li>
                        <strong>Ввод в эксплуатацию</strong>. Только пройдя все шаги <del>мы обретаем свободу</del> технология начинает эксплуатироваться на постоянной основе.
                    </li>
                </h5></ol>
                <br/>
                <h4>
                    Текущие инновации, используемые в сети отелей:
                </h4>
                <br/>
                <TechsAccordion/>
                <br/>
                <h4 className="lh-base">
                    Несмотря на все мы понимаем незаменимость людей, и поэтому за работой роботов, систем и проч. пристально
                    следят люди, готовые в любой момент прийти на помощь. 
                </h4>
                <br/>
                <br/>
            </div>
        );
    }
}